---
title: DividedSurfaceFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DividedSurfaceFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 32
---

# DividedSurfaceFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId DividedSurfaceCannotApplyDivideSettings { get; }` | `DividedSurfaceFailures.DividedSurfaceCannotApplyDivideSettings` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCoincidingSplittingWorkplanes { get; }` | `DividedSurfaceFailures.DividedSurfaceCoincidingSplittingWorkplanes` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainBelongsToMultipleBeltIntervals { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainBelongsToMultipleBeltIntervals` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainBothUandV { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainBothUandV` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainDoesNotEngageUorV { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainDoesNotEngageUorV` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainGeneralProblem { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainGeneralProblem` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainIntersection { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainIntersection` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainIsTooClosedToGridlines { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainIsTooClosedToGridlines` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainMultipleSeqIntersWithDivLine { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainMultipleSeqIntersWithDivLine` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainNonSeqIntersWithDivLines { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainNonSeqIntersWithDivLines` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveChainUnsortableBucket { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveChainUnsortableBucket` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveFromChainMultipleIntersWithDivLine { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveFromChainMultipleIntersWithDivLine` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCurveLoopChainIntersectedByExtensions { get; }` | `DividedSurfaceFailures.DividedSurfaceCurveLoopChainIntersectedByExtensions` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCuttingSurfaceDoesNotCutMeshFace { get; }` | `DividedSurfaceFailures.DividedSurfaceCuttingSurfaceDoesNotCutMeshFace` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCuttingSurfaceGeneralProblem { get; }` | `DividedSurfaceFailures.DividedSurfaceCuttingSurfaceGeneralProblem` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceCuttingSurfaceMakesMultipleCuts { get; }` | `DividedSurfaceFailures.DividedSurfaceCuttingSurfaceMakesMultipleCuts` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceDidNotRegenerateProperly { get; }` | `DividedSurfaceFailures.DividedSurfaceDidNotRegenerateProperly` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceDiscardedSplittersWarning { get; }` | `DividedSurfaceFailures.DividedSurfaceDiscardedSplittersWarning` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceIgnoresSplitters { get; }` | `DividedSurfaceFailures.DividedSurfaceIgnoresSplitters` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceInvalidSpacing { get; }` | `DividedSurfaceFailures.DividedSurfaceInvalidSpacing` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceLoopsOfSplittingCurves { get; }` | `DividedSurfaceFailures.DividedSurfaceLoopsOfSplittingCurves` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids { get; }` | `DividedSurfaceFailures.DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceSelfIntersectingCurveLoopChain { get; }` | `DividedSurfaceFailures.DividedSurfaceSelfIntersectingCurveLoopChain` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceSingleCurveLoopsAsSplitters { get; }` | `DividedSurfaceFailures.DividedSurfaceSingleCurveLoopsAsSplitters` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids { get; }` | `DividedSurfaceFailures.DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceSplitManagerProblem1dNonWPCurve { get; }` | `DividedSurfaceFailures.DividedSurfaceSplitManagerProblem1dNonWPCurve` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceSplitManagerProblemClosedArcOrEllipse { get; }` | `DividedSurfaceFailures.DividedSurfaceSplitManagerProblemClosedArcOrEllipse` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceSplitRefInvisible { get; }` | `DividedSurfaceFailures.DividedSurfaceSplitRefInvisible` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors { get; }` | `DividedSurfaceFailures.DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceSplittingCurvesWithMultipleNeighbors { get; }` | `DividedSurfaceFailures.DividedSurfaceSplittingCurvesWithMultipleNeighbors` | FailureDefinitionId |
| `FailureDefinitionId DividedSurfaceZeroLengthSplittingCurve { get; }` | `DividedSurfaceFailures.DividedSurfaceZeroLengthSplittingCurve` | FailureDefinitionId |
| `FailureDefinitionId MeshTopologicalSortFailed { get; }` | `DividedSurfaceFailures.MeshTopologicalSortFailed` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```